garyPenhook/PIC-Assembler/device_includes/pic16f13115.inc
// Register: CLBCLK
#define CLBCLK CLBCLK
CLBCLK                                   equ 0515h
// bitfield definitions
CLBCLK_CLK_POSN                          equ 0000h
CLBCLK_CLK_POSITION                      equ 0000h
CLBCLK_CLK_SIZE                          equ 0004h
CLBCLK_CLK_LENGTH                        equ 0004h
CLBCLK_CLK_MASK                          equ 000Fh
CLBCLK_CLK0_POSN                         equ 0000h
CLBCLK_CLK0_POSITION                     equ 0000h
CLBCLK_CLK0_SIZE                         equ 0001h
CLBCLK_CLK0_LENGTH                       equ 0001h
CLBCLK_CLK0_MASK                         equ 0001h
CLBCLK_CLK1_POSN                         equ 0001h
CLBCLK_CLK1_POSITION                     equ 0001h
CLBCLK_CLK1_SIZE                         equ 0001h
CLBCLK_CLK1_LENGTH                       equ 0001h
CLBCLK_CLK1_MASK                         equ 0002h
CLBCLK_CLK2_POSN                         equ 0002h
CLBCLK_CLK2_POSITION                     equ 0002h
CLBCLK_CLK2_SIZE                         equ 0001h
CLBCLK_CLK2_LENGTH                       equ 0001h
CLBCLK_CLK2_MASK                         equ 0004h
CLBCLK_CLK3_POSN                         equ 0003h
CLBCLK_CLK3_POSITION                     equ 0003h
CLBCLK_CLK3_SIZE                         equ 0001h
CLBCLK_CLK3_LENGTH                       equ 0001h
CLBCLK_CLK3_MASK                         equ 0008h

// Register: CLBPPSCON4
#define CLBPPSCON4 CLBPPSCON4
CLBPPSCON4                               equ 0516h
// bitfield definitions
CLBPPSCON4_OESEL6_POSN                   equ 0000h
CLBPPSCON4_OESEL6_POSITION               equ 0000h
CLBPPSCON4_OESEL6_SIZE                   equ 0004h
CLBPPSCON4_OESEL6_LENGTH                 equ 0004h
CLBPPSCON4_OESEL6_MASK                   equ 000Fh
CLBPPSCON4_OESEL7_POSN                   equ 0004h
CLBPPSCON4_OESEL7_POSITION               equ 0004h
CLBPPSCON4_OESEL7_SIZE                   equ 0004h
CLBPPSCON4_OESEL7_LENGTH                 equ 0004h
CLBPPSCON4_OESEL7_MASK                   equ 00F0h

// Register: CLBPPSCON3
#define CLBPPSCON3 CLBPPSCON3
CLBPPSCON3                               equ 0517h
// bitfield definitions
CLBPPSCON3_OESEL4_POSN                   equ 0000h
CLBPPSCON3_OESEL4_POSITION               equ 0000h
CLBPPSCON3_OESEL4_SIZE                   equ 0004h
CLBPPSCON3_OESEL4_LENGTH                 equ 0004h
CLBPPSCON3_OESEL4_MASK                   equ 000Fh
CLBPPSCON3_OESEL5_POSN                   equ 0004h
CLBPPSCON3_OESEL5_POSITION               equ 0004h
CLBPPSCON3_OESEL5_SIZE                   equ 0004h
CLBPPSCON3_OESEL5_LENGTH                 equ 0004h
CLBPPSCON3_OESEL5_MASK                   equ 00F0h

// Register: CLBPPSCON2
#define CLBPPSCON2 CLBPPSCON2
CLBPPSCON2                               equ 0518h
// bitfield definitions
CLBPPSCON2_OESEL2_POSN                   equ 0000h
CLBPPSCON2_OESEL2_POSITION               equ 0000h
CLBPPSCON2_OESEL2_SIZE                   equ 0004h
CLBPPSCON2_OESEL2_LENGTH                 equ 0004h
CLBPPSCON2_OESEL2_MASK                   equ 000Fh
CLBPPSCON2_OESEL3_POSN                   equ 0004h
CLBPPSCON2_OESEL3_POSITION               equ 0004h
CLBPPSCON2_OESEL3_SIZE                   equ 0004h
CLBPPSCON2_OESEL3_LENGTH                 equ 0004h
CLBPPSCON2_OESEL3_MASK                   equ 00F0h

// Register: CLBPPSCON1
#define CLBPPSCON1 CLBPPSCON1
CLBPPSCON1                               equ 0519h
// bitfield definitions
CLBPPSCON1_OESEL0_POSN                   equ 0000h
CLBPPSCON1_OESEL0_POSITION               equ 0000h
CLBPPSCON1_OESEL0_SIZE                   equ 0004h
CLBPPSCON1_OESEL0_LENGTH                 equ 0004h
CLBPPSCON1_OESEL0_MASK                   equ 000Fh
CLBPPSCON1_OESEL1_POSN                   equ 0004h
CLBPPSCON1_OESEL1_POSITION               equ 0004h
CLBPPSCON1_OESEL1_SIZE                   equ 0004h
CLBPPSCON1_OESEL1_LENGTH                 equ 0004h
CLBPPSCON1_OESEL1_MASK                   equ 00F0h

// Register: CLCnCON
#define CLCnCON CLCnCON
CLCnCON                                  equ 068Ch
// bitfield definitions
CLCnCON_MODE_POSN                        equ 0000h
CLCnCON_MODE_POSITION                    equ 0000h
CLCnCON_MODE_SIZE                        equ 0003h
CLCnCON_MODE_LENGTH                      equ 0003h
CLCnCON_MODE_MASK                        equ 0007h
CLCnCON_INTN_POSN                        equ 0003h
CLCnCON_INTN_POSITION                    equ 0003h
CLCnCON_INTN_SIZE                        equ 0001h
CLCnCON_INTN_LENGTH                      equ 0001h
CLCnCON_INTN_MASK                        equ 0008h
CLCnCON_INTP_POSN                        equ 0004h
CLCnCON_INTP_POSITION                    equ 0004h
CLCnCON_INTP_SIZE                        equ 0001h
CLCnCON_INTP_LENGTH                      equ 0001h
CLCnCON_INTP_MASK                        equ 0010h
CLCnCON_OUT_POSN                         equ 0005h
CLCnCON_OUT_POSITION                     equ 0005h
CLCnCON_OUT_SIZE                         equ 0001h
CLCnCON_OUT_LENGTH                       equ 0001h
CLCnCON_OUT_MASK                         equ 0020h
CLCnCON_EN_POSN                          equ 0007h
CLCnCON_EN_POSITION                      equ 0007h
CLCnCON_EN_SIZE                          equ 0001h
CLCnCON_EN_LENGTH                        equ 0001h
CLCnCON_EN_MASK                          equ 0080h
CLCnCON_MODE0_POSN                       equ 0000h
CLCnCON_MODE0_POSITION                   equ 0000h
CLCnCON_MODE0_SIZE                       equ 0001h
CLCnCON_MODE0_LENGTH                     equ 0001h
CLCnCON_MODE0_MASK                       equ 0001h
CLCnCON_MODE1_POSN                       equ 0001h
CLCnCON_MODE1_POSITION                   equ 0001h
CLCnCON_MODE1_SIZE                       equ 0001h
CLCnCON_MODE1_LENGTH                     equ 0001h
CLCnCON_MODE1_MASK                       equ 0002h
CLCnCON_MODE2_POSN                       equ 0002h
CLCnCON_MODE2_POSITION                   equ 0002h
CLCnCON_MODE2_SIZE                       equ 0001h
CLCnCON_MODE2_LENGTH                     equ 0001h
CLCnCON_MODE2_MASK                       equ 0004h

// Register: CLCnPOL
#define CLCnPOL CLCnPOL
CLCnPOL                                  equ 068Dh
// bitfield definitions
CLCnPOL_G1POL_POSN                       equ 0000h
CLCnPOL_G1POL_POSITION                   equ 0000h
CLCnPOL_G1POL_SIZE                       equ 0001h
CLCnPOL_G1POL_LENGTH                     equ 0001h
CLCnPOL_G1POL_MASK                       equ 0001h
CLCnPOL_G2POL_POSN                       equ 0001h
CLCnPOL_G2POL_POSITION                   equ 0001h
CLCnPOL_G2POL_SIZE                       equ 0001h
CLCnPOL_G2POL_LENGTH                     equ 0001h
CLCnPOL_G2POL_MASK                       equ 0002h
CLCnPOL_G3POL_POSN                       equ 0002h
CLCnPOL_G3POL_POSITION                   equ 0002h
CLCnPOL_G3POL_SIZE                       equ 0001h
CLCnPOL_G3POL_LENGTH                     equ 0001h
CLCnPOL_G3POL_MASK                       equ 0004h
CLCnPOL_G4POL_POSN                       equ 0003h
CLCnPOL_G4POL_POSITION                   equ 0003h
CLCnPOL_G4POL_SIZE                       equ 0001h
CLCnPOL_G4POL_LENGTH                     equ 0001h
CLCnPOL_G4POL_MASK                       equ 0008h
CLCnPOL_POL_POSN                         equ 0007h
CLCnPOL_POL_POSITION                     equ 0007h
CLCnPOL_POL_SIZE                         equ 0001h
CLCnPOL_POL_LENGTH                       equ 0001h
CLCnPOL_POL_MASK                         equ 0080h

// Register: CLCnSEL0
#define CLCnSEL0 CLCnSEL0
CLCnSEL0                                 equ 068Eh
// bitfield definitions
CLCnSEL0_D1S_POSN                        equ 0000h
CLCnSEL0_D1S_POSITION                    equ 0000h
CLCnSEL0_D1S_SIZE                        equ 0008h
CLCnSEL0_D1S_LENGTH                      equ 0008h
CLCnSEL0_D1S_MASK                        equ 00FFh
CLCnSEL0_D1S0_POSN                       equ 0000h
CLCnSEL0_D1S0_POSITION                   equ 0000h
CLCnSEL0_D1S0_SIZE                       equ 0001h
CLCnSEL0_D1S0_LENGTH                     equ 0001h
CLCnSEL0_D1S0_MASK                       equ 0001h
CLCnSEL0_D1S1_POSN                       equ 0001h
CLCnSEL0_D1S1_POSITION                   equ 0001h
CLCnSEL0_D1S1_SIZE                       equ 0001h
CLCnSEL0_D1S1_LENGTH                     equ 0001h
CLCnSEL0_D1S1_MASK                       equ 0002h
CLCnSEL0_D1S2_POSN                       equ 0002h
CLCnSEL0_D1S2_POSITION                   equ 0002h
CLCnSEL0_D1S2_SIZE                       equ 0001h
CLCnSEL0_D1S2_LENGTH                     equ 0001h
CLCnSEL0_D1S2_MASK                       equ 0004h
CLCnSEL0_D1S3_POSN                       equ 0003h
CLCnSEL0_D1S3_POSITION                   equ 0003h
CLCnSEL0_D1S3_SIZE                       equ 0001h
CLCnSEL0_D1S3_LENGTH                     equ 0001h
CLCnSEL0_D1S3_MASK                       equ 0008h
CLCnSEL0_D1S4_POSN                       equ 0004h
CLCnSEL0_D1S4_POSITION                   equ 0004h
CLCnSEL0_D1S4_SIZE                       equ 0001h
CLCnSEL0_D1S4_LENGTH                     equ 0001h
CLCnSEL0_D1S4_MASK                       equ 0010h
CLCnSEL0_D1S5_POSN                       equ 0005h
CLCnSEL0_D1S5_POSITION                   equ 0005h
CLCnSEL0_D1S5_SIZE                       equ 0001h
CLCnSEL0_D1S5_LENGTH                     equ 0001h
CLCnSEL0_D1S5_MASK                       equ 0020h
CLCnSEL0_D1S6_POSN                       equ 0006h
CLCnSEL0_D1S6_POSITION                   equ 0006h
CLCnSEL0_D1S6_SIZE                       equ 0001h
CLCnSEL0_D1S6_LENGTH                     equ 0001h
CLCnSEL0_D1S6_MASK                       equ 0040h

// Register: CLCnSEL1
#define CLCnSEL1 CLCnSEL1
CLCnSEL1                                 equ 068Fh
// bitfield definitions
CLCnSEL1_D2S_POSN                        equ 0000h
CLCnSEL1_D2S_POSITION                    equ 0000h
CLCnSEL1_D2S_SIZE                        equ 0008h
CLCnSEL1_D2S_LENGTH                      equ 0008h
CLCnSEL1_D2S_MASK                        equ 00FFh
CLCnSEL1_D2S0_POSN                       equ 0000h
CLCnSEL1_D2S0_POSITION                   equ 0000h
CLCnSEL1_D2S0_SIZE                       equ 0001h
CLCnSEL1_D2S0_LENGTH                     equ 0001h
CLCnSEL1_D2S0_MASK                       equ 0001h
CLCnSEL1_D2S1_POSN                       equ 0001h
CLCnSEL1_D2S1_POSITION                   equ 0001h
CLCnSEL1_D2S1_SIZE                       equ 0001h
CLCnSEL1_D2S1_LENGTH                     equ 0001h
CLCnSEL1_D2S1_MASK                       equ 0002h
CLCnSEL1_D2S2_POSN                       equ 0002h
CLCnSEL1_D2S2_POSITION                   equ 0002h
CLCnSEL1_D2S2_SIZE                       equ 0001h
CLCnSEL1_D2S2_LENGTH                     equ 0001h
CLCnSEL1_D2S2_MASK                       equ 0004h
CLCnSEL1_D2S3_POSN                       equ 0003h
CLCnSEL1_D2S3_POSITION                   equ 0003h
CLCnSEL1_D2S3_SIZE                       equ 0001h
CLCnSEL1_D2S3_LENGTH                     equ 0001h
CLCnSEL1_D2S3_MASK                       equ 0008h
CLCnSEL1_D2S4_POSN                       equ 0004h
CLCnSEL1_D2S4_POSITION                   equ 0004h
CLCnSEL1_D2S4_SIZE                       equ 0001h
CLCnSEL1_D2S4_LENGTH                     equ 0001h
CLCnSEL1_D2S4_MASK                       equ 0010h
CLCnSEL1_D2S5_POSN                       equ 0005h
CLCnSEL1_D2S5_POSITION                   equ 0005h
CLCnSEL1_D2S5_SIZE                       equ 0001h
CLCnSEL1_D2S5_LENGTH                     equ 0001h
CLCnSEL1_D2S5_MASK                       equ 0020h
CLCnSEL1_D2S6_POSN                       equ 0006h
CLCnSEL1_D2S6_POSITION                   equ 0006h
CLCnSEL1_D2S6_SIZE                       equ 0001h
CLCnSEL1_D2S6_LENGTH                     equ 0001h
CLCnSEL1_D2S6_MASK                       equ 0040h

// Register: CLCnSEL2
#define CLCnSEL2 CLCnSEL2
CLCnSEL2                                 equ 0690h
// bitfield definitions
CLCnSEL2_D3S_POSN                        equ 0000h
CLCnSEL2_D3S_POSITION                    equ 0000h
CLCnSEL2_D3S_SIZE                        equ 0008h
CLCnSEL2_D3S_LENGTH                      equ 0008h
CLCnSEL2_D3S_MASK                        equ 00FFh
CLCnSEL2_D3S0_POSN                       equ 0000h
CLCnSEL2_D3S0_POSITION                   equ 0000h
CLCnSEL2_D3S0_SIZE                       equ 0001h
CLCnSEL2_D3S0_LENGTH                     equ 0001h
CLCnSEL2_D3S0_MASK                       equ 0001h
CLCnSEL2_D3S1_POSN                       equ 0001h
CLCnSEL2_D3S1_POSITION                   equ 0001h
CLCnSEL2_D3S1_SIZE                       equ 0001h
CLCnSEL2_D3S1_LENGTH                     equ 0001h
CLCnSEL2_D3S1_MASK                       equ 0002h
CLCnSEL2_D3S2_POSN                       equ 0002h
CLCnSEL2_D3S2_POSITION                   equ 0002h
CLCnSEL2_D3S2_SIZE                       equ 0001h
CLCnSEL2_D3S2_LENGTH                     equ 0001h
CLCnSEL2_D3S2_MASK                       equ 0004h
CLCnSEL2_D3S3_POSN                       equ 0003h
CLCnSEL2_D3S3_POSITION                   equ 0003h
CLCnSEL2_D3S3_SIZE                       equ 0001h
CLCnSEL2_D3S3_LENGTH                     equ 0001h
CLCnSEL2_D3S3_MASK                       equ 0008h
CLCnSEL2_D3S4_POSN                       equ 0004h
CLCnSEL2_D3S4_POSITION                   equ 0004h
CLCnSEL2_D3S4_SIZE                       equ 0001h
CLCnSEL2_D3S4_LENGTH                     equ 0001h
CLCnSEL2_D3S4_MASK                       equ 0010h
CLCnSEL2_D3S5_POSN                       equ 0005h
CLCnSEL2_D3S5_POSITION                   equ 0005h
CLCnSEL2_D3S5_SIZE                       equ 0001h
CLCnSEL2_D3S5_LENGTH                     equ 0001h
CLCnSEL2_D3S5_MASK                       equ 0020h
CLCnSEL2_D3S6_POSN                       equ 0006h
CLCnSEL2_D3S6_POSITION                   equ 0006h
CLCnSEL2_D3S6_SIZE                       equ 0001h
CLCnSEL2_D3S6_LENGTH                     equ 0001h
CLCnSEL2_D3S6_MASK                       equ 0040h

// Register: CLCnSEL3
#define CLCnSEL3 CLCnSEL3
CLCnSEL3                                 equ 0691h
// bitfield definitions
CLCnSEL3_D4S_POSN                        equ 0000h
CLCnSEL3_D4S_POSITION                    equ 0000h
CLCnSEL3_D4S_SIZE                        equ 0008h
CLCnSEL3_D4S_LENGTH                      equ 0008h
CLCnSEL3_D4S_MASK                        equ 00FFh
CLCnSEL3_D4S0_POSN                       equ 0000h
CLCnSEL3_D4S0_POSITION                   equ 0000h
CLCnSEL3_D4S0_SIZE                       equ 0001h
CLCnSEL3_D4S0_LENGTH                     equ 0001h
CLCnSEL3_D4S0_MASK                       equ 0001h
CLCnSEL3_D4S1_POSN                       equ 0001h
CLCnSEL3_D4S1_POSITION                   equ 0001h
CLCnSEL3_D4S1_SIZE                       equ 0001h
CLCnSEL3_D4S1_LENGTH                     equ 0001h
CLCnSEL3_D4S1_MASK                       equ 0002h
CLCnSEL3_D4S2_POSN                       equ 0002h
CLCnSEL3_D4S2_POSITION                   equ 0002h
CLCnSEL3_D4S2_SIZE                       equ 0001h
CLCnSEL3_D4S2_LENGTH                     equ 0001h
CLCnSEL3_D4S2_MASK                       equ 0004h
CLCnSEL3_D4S3_POSN                       equ 0003h
CLCnSEL3_D4S3_POSITION                   equ 0003h
CLCnSEL3_D4S3_SIZE                       equ 0001h
CLCnSEL3_D4S3_LENGTH                     equ 0001h
CLCnSEL3_D4S3_MASK                       equ 0008h
CLCnSEL3_D4S4_POSN                       equ 0004h
CLCnSEL3_D4S4_POSITION                   equ 0004h
CLCnSEL3_D4S4_SIZE                       equ 0001h
CLCnSEL3_D4S4_LENGTH                     equ 0001h
CLCnSEL3_D4S4_MASK                       equ 0010h
CLCnSEL3_D4S5_POSN                       equ 0005h
CLCnSEL3_D4S5_POSITION                   equ 0005h
CLCnSEL3_D4S5_SIZE                       equ 0001h
CLCnSEL3_D4S5_LENGTH                     equ 0001h
CLCnSEL3_D4S5_MASK                       equ 0020h
CLCnSEL3_D4S6_POSN                       equ 0006h
CLCnSEL3_D4S6_POSITION                   equ 0006h
CLCnSEL3_D4S6_SIZE                       equ 0001h
CLCnSEL3_D4S6_LENGTH                     equ 0001h
CLCnSEL3_D4S6_MASK                       equ 0040h

// Register: CLCnGLS0
#define CLCnGLS0 CLCnGLS0
CLCnGLS0                                 equ 0692h
// bitfield definitions
CLCnGLS0_G1D1N_POSN                      equ 0000h
CLCnGLS0_G1D1N_POSITION                  equ 0000h
CLCnGLS0_G1D1N_SIZE                      equ 0001h
CLCnGLS0_G1D1N_LENGTH                    equ 0001h
CLCnGLS0_G1D1N_MASK                      equ 0001h
CLCnGLS0_G1D1T_POSN                      equ 0001h
CLCnGLS0_G1D1T_POSITION                  equ 0001h
CLCnGLS0_G1D1T_SIZE                      equ 0001h
CLCnGLS0_G1D1T_LENGTH                    equ 0001h
CLCnGLS0_G1D1T_MASK                      equ 0002h
CLCnGLS0_G1D2N_POSN                      equ 0002h
CLCnGLS0_G1D2N_POSITION                  equ 0002h
CLCnGLS0_G1D2N_SIZE                      equ 0001h
CLCnGLS0_G1D2N_LENGTH                    equ 0001h
CLCnGLS0_G1D2N_MASK                      equ 0004h
CLCnGLS0_G1D2T_POSN                      equ 0003h
CLCnGLS0_G1D2T_POSITION                  equ 0003h
CLCnGLS0_G1D2T_SIZE                      equ 0001h
CLCnGLS0_G1D2T_LENGTH                    equ 0001h
CLCnGLS0_G1D2T_MASK                      equ 0008h
CLCnGLS0_G1D3N_POSN                      equ 0004h
CLCnGLS0_G1D3N_POSITION                  equ 0004h
CLCnGLS0_G1D3N_SIZE                      equ 0001h
CLCnGLS0_G1D3N_LENGTH                    equ 0001h
CLCnGLS0_G1D3N_MASK                      equ 0010h
CLCnGLS0_G1D3T_POSN                      equ 0005h
CLCnGLS0_G1D3T_POSITION                  equ 0005h
CLCnGLS0_G1D3T_SIZE                      equ 0001h
CLCnGLS0_G1D3T_LENGTH                    equ 0001h
CLCnGLS0_G1D3T_MASK                      equ 0020h
CLCnGLS0_G1D4N_POSN                      equ 0006h
CLCnGLS0_G1D4N_POSITION                  equ 0006h
CLCnGLS0_G1D4N_SIZE                      equ 0001h
CLCnGLS0_G1D4N_LENGTH                    equ 0001h
CLCnGLS0_G1D4N_MASK                      equ 0040h
CLCnGLS0_G1D4T_POSN                      equ 0007h
CLCnGLS0_G1D4T_POSITION                  equ 0007h
CLCnGLS0_G1D4T_SIZE                      equ 0001h
CLCnGLS0_G1D4T_LENGTH                    equ 0001h
CLCnGLS0_G1D4T_MASK                      equ 0080h

