garyPenhook/PIC-Assembler/device_includes/pic16f13115.inc
// Register: CRCOUTU
#define CRCOUTU CRCOUTU
CRCOUTU                                  equ 01CA3h
// bitfield definitions
CRCOUTU_OUT_POSN                         equ 0000h
CRCOUTU_OUT_POSITION                     equ 0000h
CRCOUTU_OUT_SIZE                         equ 0008h
CRCOUTU_OUT_LENGTH                       equ 0008h
CRCOUTU_OUT_MASK                         equ 00FFh
CRCOUTU_OUT16_POSN                       equ 0000h
CRCOUTU_OUT16_POSITION                   equ 0000h
CRCOUTU_OUT16_SIZE                       equ 0001h
CRCOUTU_OUT16_LENGTH                     equ 0001h
CRCOUTU_OUT16_MASK                       equ 0001h
CRCOUTU_OUT17_POSN                       equ 0001h
CRCOUTU_OUT17_POSITION                   equ 0001h
CRCOUTU_OUT17_SIZE                       equ 0001h
CRCOUTU_OUT17_LENGTH                     equ 0001h
CRCOUTU_OUT17_MASK                       equ 0002h
CRCOUTU_OUT18_POSN                       equ 0002h
CRCOUTU_OUT18_POSITION                   equ 0002h
CRCOUTU_OUT18_SIZE                       equ 0001h
CRCOUTU_OUT18_LENGTH                     equ 0001h
CRCOUTU_OUT18_MASK                       equ 0004h
CRCOUTU_OUT19_POSN                       equ 0003h
CRCOUTU_OUT19_POSITION                   equ 0003h
CRCOUTU_OUT19_SIZE                       equ 0001h
CRCOUTU_OUT19_LENGTH                     equ 0001h
CRCOUTU_OUT19_MASK                       equ 0008h
CRCOUTU_OUT20_POSN                       equ 0004h
CRCOUTU_OUT20_POSITION                   equ 0004h
CRCOUTU_OUT20_SIZE                       equ 0001h
CRCOUTU_OUT20_LENGTH                     equ 0001h
CRCOUTU_OUT20_MASK                       equ 0010h
CRCOUTU_OUT21_POSN                       equ 0005h
CRCOUTU_OUT21_POSITION                   equ 0005h
CRCOUTU_OUT21_SIZE                       equ 0001h
CRCOUTU_OUT21_LENGTH                     equ 0001h
CRCOUTU_OUT21_MASK                       equ 0020h
CRCOUTU_OUT22_POSN                       equ 0006h
CRCOUTU_OUT22_POSITION                   equ 0006h
CRCOUTU_OUT22_SIZE                       equ 0001h
CRCOUTU_OUT22_LENGTH                     equ 0001h
CRCOUTU_OUT22_MASK                       equ 0040h
CRCOUTU_OUT23_POSN                       equ 0007h
CRCOUTU_OUT23_POSITION                   equ 0007h
CRCOUTU_OUT23_SIZE                       equ 0001h
CRCOUTU_OUT23_LENGTH                     equ 0001h
CRCOUTU_OUT23_MASK                       equ 0080h

// Register: CRCSHFTU
#define CRCSHFTU CRCSHFTU
CRCSHFTU                                 equ 01CA3h
// bitfield definitions
CRCSHFTU_SHIFT_POSN                      equ 0000h
CRCSHFTU_SHIFT_POSITION                  equ 0000h
CRCSHFTU_SHIFT_SIZE                      equ 0008h
CRCSHFTU_SHIFT_LENGTH                    equ 0008h
CRCSHFTU_SHIFT_MASK                      equ 00FFh
CRCSHFTU_SHIFT16_POSN                    equ 0000h
CRCSHFTU_SHIFT16_POSITION                equ 0000h
CRCSHFTU_SHIFT16_SIZE                    equ 0001h
CRCSHFTU_SHIFT16_LENGTH                  equ 0001h
CRCSHFTU_SHIFT16_MASK                    equ 0001h
CRCSHFTU_SHIFT17_POSN                    equ 0001h
CRCSHFTU_SHIFT17_POSITION                equ 0001h
CRCSHFTU_SHIFT17_SIZE                    equ 0001h
CRCSHFTU_SHIFT17_LENGTH                  equ 0001h
CRCSHFTU_SHIFT17_MASK                    equ 0002h
CRCSHFTU_SHIFT18_POSN                    equ 0002h
CRCSHFTU_SHIFT18_POSITION                equ 0002h
CRCSHFTU_SHIFT18_SIZE                    equ 0001h
CRCSHFTU_SHIFT18_LENGTH                  equ 0001h
CRCSHFTU_SHIFT18_MASK                    equ 0004h
CRCSHFTU_SHIFT19_POSN                    equ 0003h
CRCSHFTU_SHIFT19_POSITION                equ 0003h
CRCSHFTU_SHIFT19_SIZE                    equ 0001h
CRCSHFTU_SHIFT19_LENGTH                  equ 0001h
CRCSHFTU_SHIFT19_MASK                    equ 0008h
CRCSHFTU_SHIFT20_POSN                    equ 0004h
CRCSHFTU_SHIFT20_POSITION                equ 0004h
CRCSHFTU_SHIFT20_SIZE                    equ 0001h
CRCSHFTU_SHIFT20_LENGTH                  equ 0001h
CRCSHFTU_SHIFT20_MASK                    equ 0010h
CRCSHFTU_SHIFT21_POSN                    equ 0005h
CRCSHFTU_SHIFT21_POSITION                equ 0005h
CRCSHFTU_SHIFT21_SIZE                    equ 0001h
CRCSHFTU_SHIFT21_LENGTH                  equ 0001h
CRCSHFTU_SHIFT21_MASK                    equ 0020h
CRCSHFTU_SHIFT22_POSN                    equ 0006h
CRCSHFTU_SHIFT22_POSITION                equ 0006h
CRCSHFTU_SHIFT22_SIZE                    equ 0001h
CRCSHFTU_SHIFT22_LENGTH                  equ 0001h
CRCSHFTU_SHIFT22_MASK                    equ 0040h
CRCSHFTU_SHIFT23_POSN                    equ 0007h
CRCSHFTU_SHIFT23_POSITION                equ 0007h
CRCSHFTU_SHIFT23_SIZE                    equ 0001h
CRCSHFTU_SHIFT23_LENGTH                  equ 0001h
CRCSHFTU_SHIFT23_MASK                    equ 0080h

// Register: CRCXORU
#define CRCXORU CRCXORU
CRCXORU                                  equ 01CA3h
// bitfield definitions
CRCXORU_XOR_POSN                         equ 0000h
CRCXORU_XOR_POSITION                     equ 0000h
CRCXORU_XOR_SIZE                         equ 0008h
CRCXORU_XOR_LENGTH                       equ 0008h
CRCXORU_XOR_MASK                         equ 00FFh
CRCXORU_XOR16_POSN                       equ 0000h
CRCXORU_XOR16_POSITION                   equ 0000h
CRCXORU_XOR16_SIZE                       equ 0001h
CRCXORU_XOR16_LENGTH                     equ 0001h
CRCXORU_XOR16_MASK                       equ 0001h
CRCXORU_XOR17_POSN                       equ 0001h
CRCXORU_XOR17_POSITION                   equ 0001h
CRCXORU_XOR17_SIZE                       equ 0001h
CRCXORU_XOR17_LENGTH                     equ 0001h
CRCXORU_XOR17_MASK                       equ 0002h
CRCXORU_XOR18_POSN                       equ 0002h
CRCXORU_XOR18_POSITION                   equ 0002h
CRCXORU_XOR18_SIZE                       equ 0001h
CRCXORU_XOR18_LENGTH                     equ 0001h
CRCXORU_XOR18_MASK                       equ 0004h
CRCXORU_XOR19_POSN                       equ 0003h
CRCXORU_XOR19_POSITION                   equ 0003h
CRCXORU_XOR19_SIZE                       equ 0001h
CRCXORU_XOR19_LENGTH                     equ 0001h
CRCXORU_XOR19_MASK                       equ 0008h
CRCXORU_XOR20_POSN                       equ 0004h
CRCXORU_XOR20_POSITION                   equ 0004h
CRCXORU_XOR20_SIZE                       equ 0001h
CRCXORU_XOR20_LENGTH                     equ 0001h
CRCXORU_XOR20_MASK                       equ 0010h
CRCXORU_XOR21_POSN                       equ 0005h
CRCXORU_XOR21_POSITION                   equ 0005h
CRCXORU_XOR21_SIZE                       equ 0001h
CRCXORU_XOR21_LENGTH                     equ 0001h
CRCXORU_XOR21_MASK                       equ 0020h
CRCXORU_XOR22_POSN                       equ 0006h
CRCXORU_XOR22_POSITION                   equ 0006h
CRCXORU_XOR22_SIZE                       equ 0001h
CRCXORU_XOR22_LENGTH                     equ 0001h
CRCXORU_XOR22_MASK                       equ 0040h
CRCXORU_XOR23_POSN                       equ 0007h
CRCXORU_XOR23_POSITION                   equ 0007h
CRCXORU_XOR23_SIZE                       equ 0001h
CRCXORU_XOR23_LENGTH                     equ 0001h
CRCXORU_XOR23_MASK                       equ 0080h

// Register: CRCOUTT
#define CRCOUTT CRCOUTT
CRCOUTT                                  equ 01CA4h
// bitfield definitions
CRCOUTT_OUT_POSN                         equ 0000h
CRCOUTT_OUT_POSITION                     equ 0000h
CRCOUTT_OUT_SIZE                         equ 0008h
CRCOUTT_OUT_LENGTH                       equ 0008h
CRCOUTT_OUT_MASK                         equ 00FFh
CRCOUTT_OUT24_POSN                       equ 0000h
CRCOUTT_OUT24_POSITION                   equ 0000h
CRCOUTT_OUT24_SIZE                       equ 0001h
CRCOUTT_OUT24_LENGTH                     equ 0001h
CRCOUTT_OUT24_MASK                       equ 0001h
CRCOUTT_OUT25_POSN                       equ 0001h
CRCOUTT_OUT25_POSITION                   equ 0001h
CRCOUTT_OUT25_SIZE                       equ 0001h
CRCOUTT_OUT25_LENGTH                     equ 0001h
CRCOUTT_OUT25_MASK                       equ 0002h
CRCOUTT_OUT26_POSN                       equ 0002h
CRCOUTT_OUT26_POSITION                   equ 0002h
CRCOUTT_OUT26_SIZE                       equ 0001h
CRCOUTT_OUT26_LENGTH                     equ 0001h
CRCOUTT_OUT26_MASK                       equ 0004h
CRCOUTT_OUT27_POSN                       equ 0003h
CRCOUTT_OUT27_POSITION                   equ 0003h
CRCOUTT_OUT27_SIZE                       equ 0001h
CRCOUTT_OUT27_LENGTH                     equ 0001h
CRCOUTT_OUT27_MASK                       equ 0008h
CRCOUTT_OUT28_POSN                       equ 0004h
CRCOUTT_OUT28_POSITION                   equ 0004h
CRCOUTT_OUT28_SIZE                       equ 0001h
CRCOUTT_OUT28_LENGTH                     equ 0001h
CRCOUTT_OUT28_MASK                       equ 0010h
CRCOUTT_OUT29_POSN                       equ 0005h
CRCOUTT_OUT29_POSITION                   equ 0005h
CRCOUTT_OUT29_SIZE                       equ 0001h
CRCOUTT_OUT29_LENGTH                     equ 0001h
CRCOUTT_OUT29_MASK                       equ 0020h
CRCOUTT_OUT30_POSN                       equ 0006h
CRCOUTT_OUT30_POSITION                   equ 0006h
CRCOUTT_OUT30_SIZE                       equ 0001h
CRCOUTT_OUT30_LENGTH                     equ 0001h
CRCOUTT_OUT30_MASK                       equ 0040h
CRCOUTT_OUT31_POSN                       equ 0007h
CRCOUTT_OUT31_POSITION                   equ 0007h
CRCOUTT_OUT31_SIZE                       equ 0001h
CRCOUTT_OUT31_LENGTH                     equ 0001h
CRCOUTT_OUT31_MASK                       equ 0080h

